# Создайте класс, который при инициализации принимает параметр «путь
# до файла». Если файл не существует (проверка с помощью модуля os), то его
# необходимо создать при инициализации объекта данного класса. В атрибут
# words должен быть помещен список всех слов из текста. У класса должны быть
# следующие методы:
# 1) delete_word – должен удалить слово, которое было передано в вызов данного метода.
# 2) update_source – сохраняет все слова обратно в файл

# ДОПОЛНИТЕЛЬНО

# Добавить метод delete_char, который удаляет переданный символ из всех слов списка words.
