# Даны два файла (в Moodle) формата csv и json, содержащие разные списки городов, их население, регион и индекс.
# Данные из файлов необходимо соединить таким образом, чтобы они содержали только уникальные значения.

# Для этого создайте класс City, у которого будут реализованы методы __hash__ и __er__.
# Поместите экземпляры класса в коллекцию, при правильно реализованных вышеуказанных методов коллекция будет содержать только уникальные города.
# Новый список городов необходимо сохранить в форматы CSV и JSON.
# Используйте собственные функции преобразований.


# ДОПОЛНИТЕЛЬНО:
# Перед сохранением данных в файл отсортируйте список по численности населения.
