# Создайте текстовый файл (шаблон), содержащий следующее:
# «Приветствую тебя, {{ user_name }}! Очень рад тебя видеть! С нашей
# последней встречи прошло {{ time }} лет… Прими этот {{ item }} и
# садись {{ place }}

# Ваша программа во время запуска должна запросить соответствующие данные у пользователя через консоль.
# Затем заполнить данный шаблон этими данными и вывести отрендеренный текст в консоль.


# ДОПОЛНИТЕЛЬНО

# Подготовьте файл ответов в формате json. При наличии этого файла программа не будет запрашивать у пользователя данные,
# а должная считать их из этого файла.
