# Программа должна запросить у пользователя следующую информацию:
# 1) имена двух персонажей;
# 2) вид соревнования;
# 3) характеристики персонажей в данном виде деятельности.

# Подготовьте шаблон, в который при рендеринге передастся полученная
# информация. В результате рендеринга должен быть получен текст,
# содержащий имя победителя (побеждает тот, чьи характеристики больше).

# При равенстве вывести соответствующею информацию Сравнение
# характеристик должно происходить в блоке if шаблонизатора.


# -----------------------------------ДОПОЛНИТЕЛЬНО--------------------------------------
# Вывод на экран должен быть в формате json или csv. Оба формата
# должны содержать следующие поля:
# 1) имя победителя
# 2) его характеристики
# 3) вид соревнования
# 4) дата проведения соревнования
# Имена полей произвольные.
