# В прошлой работе Вы получили список городов в формате json или csv.
# Необходимо сделать шаблон в формате html. Шаблон необходимо заполнить
# данными из Ваших файлов и сохранить как result.html.
# «добавление стилей в самом html документе или подключение файла css
# для более приятного отображения – приветствуется»

# -----------------------------------ДОПОЛНИТЕЛЬНО--------------------------------------
# Ваша программа должна перед рендерингом запросить наименьшее
# количество население города для помещения его в шаблон. То есть города, чье
# население ниже установленной планки не должны присутствовать в
# result.html. Фильтрация должна быть в заложена в шаблон.
