# Определить метод get_len для вычисления длины отрезка. Длина отрезка
# вычисляется следующим образом: (формула)

# Определить метод приведения к строке. Пример: AB(xa, ya; xb, yb)

# Определить метод сложения двух отрезков таким образом, чтобы возвращался новый экземпляр класса BrokenLine.


# -----------------------------------ДОПОЛНИТЕЛЬНО--------------------------------------
# 1) Ограничить сложение двух отрезков таким образом, чтобы
# складывались только те отрезки, которые имеют одну общую точку.
# Последовательность точек значения не имеет.
# 2) При сложении с экземпляром класса BrokenLine, точки отрезка
# должны добавиться в список точек ломанной.
# 3) При сложении с точкой должен вернуться объект BrokenLine.
